In [1]:
import pandas as pd

In [18]:
df = pd.DataFrame({'a':[1, 2, 3, 4, 5]})

- 문제 : a가 2보다 작으면 '2미만, 4보다 작으면 '4미만', 4보다 크면 '4이상' 이 저장된 b 칼럼을 추가하시오

In [19]:
df

   a
0  1
1  2
2  3
3  4
4  5

In [20]:
df['b'] = 0
df

   a  b
0  1  0
1  2  0
2  3  0
3  4  0
4  5  0

In [21]:
 a = df[df['a'] < 2 ]
a

   a  b
0  1  0

In [23]:
[a.index]

[Int64Index([0], dtype='int64')]

In [24]:
df['b'][a.index] = '2 미만'

In [25]:
df

   a     b
0  1  2 미만
1  2     0
2  3     0
3  4     0
4  5     0

In [27]:
a = df[(df['a'] >= 2 ) & (df['a'] <4) ]
a

   a  b
1  2  0
2  3  0

In [28]:
df['b'][a.index] = '4 미만'

In [29]:
df

   a     b
0  1  2 미만
1  2  4 미만
2  3  4 미만
3  4     0
4  5     0

In [30]:
a = df[df['a'] >= 4 ]

In [31]:
df['b'][a.index] = '4 이상'

In [32]:
df

   a     b
0  1  2 미만
1  2  4 미만
2  3  4 미만
3  4  4 이상
4  5  4 이상

- 함수 apply를 이용

In [33]:
def case_fuction(x):
    if x < 2:
        return '2 미만'
    elif x < 4:
        return '4 미만'
    else:
        return '4 이상'

In [34]:
case_fuction(6)

'4 이상'

In [36]:
df['c' ] = df['a'].apply(case_fuction)

In [37]:
df

   a     b     c
0  1  2 미만  2 미만
1  2  4 미만  4 미만
2  3  4 미만  4 미만
3  4  4 이상  4 이상
4  5  4 이상  4 이상

- 문제 a가 1이면 'one', 2이면 'two', 3이면 'three', 4이면'four', 5이면 'five'를 출력하는 칼럼 d

In [38]:
def fuction(x):
    if x==1:
        return 'one'
    elif x==2:
        return 'two'
    elif x==3:
        return 'three'
    elif x==4:
        return 'four'
    elif x==5:
        return 'five'

In [39]:
df['d'] = df['a'].apply(fuction)

In [40]:
df

   a     b     c      d
0  1  2 미만  2 미만    one
1  2  4 미만  4 미만    two
2  3  4 미만  4 미만  three
3  4  4 이상  4 이상   four
4  5  4 이상  4 이상   five

- map이용하기

In [41]:
a = {1 : 'one', 2: 'two', 3: 'three', 4: 'four', 5: 'five' }

In [42]:
df['e'] = df['a'].map(a)

In [43]:
df

   a     b     c      d      e
0  1  2 미만  2 미만    one    one
1  2  4 미만  4 미만    two    two
2  3  4 미만  4 미만  three  three
3  4  4 이상  4 이상   four   four
4  5  4 이상  4 이상   five   five